// 第一题
// 题目描述

// 群大雁往南飞，给定一个字符串记录地面上的游客听到的大雁叫声，请给出叫声最少由几只大雁发出。具体的
// 1.大雅发出的完整叫声为”quack“，因为有多只大雁同一时间嘎嘎作响，所以字符串中可能会混合多个”quack”
// 2.大雁会依次完整发出”quack”，即字符串中'q，u,a，c，k这5个字母按顺序完整存
// 在才能计数为一只大雁如果不完整或者没有按顺序则不予计数。
// 3.如果字符串不是由'q，u'，a'，c,k字符组合而成，或者没有找到一只大雁，请返回-1.

// 输入描述
// 一个字符串，包含大雁quack的叫声。1<=字符串长度<=1000，字符串中的字符只有q,u,a,c，k
// 输出描述
// 大雁的数量

// 第二题
// 勾股数，是由三个正整数组成的数组；能符合勾股定理 a*a + b*b = c*c ，(a, b, c) 的正整数解。如果 (a, b, c) 是勾股数，
// 它们的正整数倍数，也是勾股数。如果 (a, b, c) 互质，它们就称为素勾股数。给定正整数[M,N]， 计算出[M,N]的素勾股数个数。

// 第三题
// 小明和朋友玩跳格子游戏，有n个连续格子组成的圆圈，每个格子有不同的分数，小朋友可以选择以任意格子起跳，但是不能跳连续的格子，不能回头跳，也不能超过一圈
// 给定一个代表每个格子得分的非负整数数组，计算能够得到的最高分数。
